In [114]:
import pandas as pd

In [115]:
# Refer to the CSV to pull information
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

# Check csv is being read and pull first 5 rows to get an idea of what the original csv contains
purchase_data.head(5)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [116]:
# Count how many different playes purchased items (identified by Screen Names)
num_of_players = len(pd.unique(purchase_data['SN']))

# Player Count

In [117]:
print(f"Total Number of Players is = {num_of_players}")

Total Number of Players is = 576

In [118]:
# Determine data type of "Item ID" to find how many unique items there are. 
purchase_data.dtypes

Purchase ID      int64
SN              object
Age              int64
Gender          object
Item ID          int64
Item Name       object
Price          float64
dtype: object

In [119]:
# Could not count Item IDs; convert Item ID column into floats
purchase_data.loc[:, "Item ID"] = purchase_data["Item ID"].astype("float")
purchase_data.dtypes

Purchase ID      int64
SN              object
Age              int64
Gender          object
Item ID        float64
Item Name       object
Price          float64
dtype: object

In [120]:
# Count how many unique items there are within Item ID
unique_ID = len(pd.unique(purchase_data["Item ID"]))
unique_ID

179

In [121]:
# Add total revenue by using .sum on "Price" column
total_revenue = purchase_data["Price"].sum()
total_revenue

2379.77

In [122]:
# Find total number of purchases
purchase_amount = len(purchase_data)
purchase_amount

780

In [123]:
# Find the average price of each item
price_average = (total_revenue/purchase_amount)
price_average

3.0509871794871795

In [124]:
price_average = "${:,.2f}".format(price_average)
total_revenue = "${:,.2f}".format(total_revenue)

# Purchasing Analysis (Total)

In [125]:
# Create lists for each variable 
purchasing_analysis = [{"Unique Items": unique_ID,
                        "Average Price": price_average,
                        "Number of Purchases": purchase_amount,
                        "Total Revenue": total_revenue}]


  
# Create DataFrame of lists to demonstrate totals
totals_df = pd.DataFrame(purchasing_analysis) 

totals_df

   Unique Items Average Price  Number of Purchases Total Revenue
0           179         $3.05                  780     $2,379.77

In [126]:
gender_count = purchase_data["Gender"].value_counts()
gender_count

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [127]:
# Isolating Male data
male_players = purchase_data.loc[purchase_data["Gender"] == "Male", :]
male_players.head(5)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108.0,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143.0,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92.0,Final Critic,4.88
3,3,Chamassasya86,24,Male,100.0,Blindscythe,3.27
4,4,Iskosia90,23,Male,131.0,Fury,1.44

In [128]:
# Isolating Female & Other data
female_players = purchase_data.loc[purchase_data["Gender"] == "Female", :]
other_players = purchase_data.loc[purchase_data["Gender"] == "Other / Non-Disclosed", :]

In [129]:
# Separate genders and count them
male = male_players["SN"].value_counts()
total_male = len(male)
female = female_players["SN"].value_counts()
total_female = len(female)
other = other_players["SN"].value_counts()
total_other = len(other)

# Check that I have the correct result
print(f"Female = {total_female}")
print(f"Male = {total_male}")
print(f"Other = {total_other}")

Female = 81
Male = 484
Other = 11

In [130]:
# Using the total for each, find percentage from total number of players
percent_male = (total_male/num_of_players)
percent_female = (total_female/num_of_players)
percent_other = (total_other/num_of_players)

In [131]:
# Format the percentages to appear properly in the df
percent_male = "{:.2%}".format(percent_male)
percent_female = "{:.2%}".format(percent_female)
percent_other = "{:.2%}".format(percent_other)

# Gender Demographics

In [132]:
# Create data frame with the information necessary for Totals and Percentage for each
demo_summary = pd.DataFrame({
    "Total Male":[total_male, total_female, total_other],
    "Percent of Players":[percent_male, percent_female, percent_other]},
    {"Male":[],
    "Female":[],
     "Other / Non-Disclosed":[],
   })
demo_summary

                       Total Male Percent of Players
Male                          484             84.03%
Female                         81             14.06%
Other / Non-Disclosed          11              1.91%

In [133]:
# Find Total purchases 
m_purchase_count = len(pd.unique(male_players["Purchase ID"]))
f_purchase_count = len(pd.unique(female_players["Purchase ID"]))
o_purchase_count = len(pd.unique(other_players["Purchase ID"]))

print(f"Males {m_purchase_count}")
print(f"Females {f_purchase_count}")
print(f"Other/Non-Disclosed {o_purchase_count}")

Males 652
Females 113
Other/Non-Disclosed 15

In [134]:
# Find total purchase value
m_purchase_value = male_players["Price"].sum()
f_purchase_value = female_players["Price"].sum()
o_purchase_value = other_players["Price"].sum()
print(f"Males {m_purchase_value}")
print(f"Females {f_purchase_value}")
print(f"Other/Non-Disclosed {o_purchase_value}")

Males 1967.64
Females 361.94
Other/Non-Disclosed 50.19

In [135]:
# Find average purchase price
m_avg_price = m_purchase_value/m_purchase_count
f_avg_price = f_purchase_value/f_purchase_count
o_avg_price = o_purchase_value/o_purchase_count

In [136]:
# Find Avg Purchase per Person
m_individual_avg = m_purchase_value/total_male
f_individual_avg = f_purchase_value/total_female
o_individual_avg = o_purchase_value/total_other

# Purchasing Analysis (Gender)

In [137]:
# Create data frame with the information necessary for Gender Purchase Analysis
gender_analysis = pd.DataFrame({
    "Purchase Count":[m_purchase_count, f_purchase_count, o_purchase_count],
    "Average Purchase Price":[m_avg_price, f_avg_price, o_avg_price],
    "Total Purchase Value":[m_purchase_value, f_purchase_value, o_purchase_value],
    "Average Purchase Total per Person":[m_individual_avg, f_individual_avg, o_individual_avg]},
    {"Male":[],
    "Female":[],
     "Other / Non-Disclosed":[],
   })

# Format each column to display currency
gender_analysis["Average Purchase Price"] = gender_analysis["Average Purchase Price"].map("${:.2f}".format)
gender_analysis["Total Purchase Value"] = gender_analysis["Total Purchase Value"].map("${:.2f}".format)
gender_analysis["Average Purchase Total per Person"] = gender_analysis["Average Purchase Total per Person"].map("${:.2f}".format)

gender_analysis

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Purchase Total per Person
Male,652,$3.02,$1967.64,$4.07
Female,113,$3.20,$361.94,$4.47
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

In [138]:
print(purchase_data["Age"].max())
print(purchase_data["Age"].min())

45
7

In [139]:
# Age Demographics - Break apart players by age
# Define bins
bins = [0, 9, 14, 19, 24, 29, 34, 39, 45]

# Lables for bins
age_labels = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [140]:
# Create a new age range column
purchase_data ["Age Range"] = pd.cut(purchase_data["Age"], bins, labels=age_labels)
purchase_data.head(5)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Range
0,0,Lisim78,20,Male,108.0,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143.0,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92.0,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100.0,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131.0,Fury,1.44,20-24

In [141]:
# Organize df by Age Range

age_ranges = purchase_data.groupby("Age Range")
age_ranges.count()

           Purchase ID   SN  Age  Gender  Item ID  Item Name  Price
Age Range
<10                 23   23   23      23       23         23     23
10-14               28   28   28      28       28         28     28
15-19              136  136  136     136      136        136    136
20-24              365  365  365     365      365        365    365
25-29              101  101  101     101      101        101    101
30-34               73   73   73      73       73         73     73
35-39               41   41   41      41       41         41     41
40+                 13   13   13      13       13         13     13

In [142]:
# Take each range and get an average amount spent
average_price_range = age_ranges["Price"].mean()
# Rename list from Price to Average Purchase Price
average_price_range = average_price_range.rename("Average Purchase Price")
average_price_range

Age Range
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: Average Purchase Price, dtype: float64

In [143]:
# Take for the total spent per range
purchase_value_range = age_ranges["Price"].sum()
# Rename list to "Total Purchase Value"
purchase_value_range = purchase_value_range.rename("Total Purchase Value")
purchase_value_range

Age Range
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Total Purchase Value, dtype: float64

In [144]:
# Take each range and find how many users are in each group by SN
purchase_count_range = age_ranges["SN"].count()
# Rename list
purchase_count_range = purchase_count_range.rename("Purchase Count")
purchase_count_range

Age Range
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Purchase Count, dtype: int64

In [145]:
#player_average_range = purchase_value_range/age_counts
#player_average_range

# Age Demographics

In [146]:
# Create new df using age demographics
pd.concat([purchase_count_range, purchase_value_range,average_price_range], axis=1)

           Purchase Count  Total Purchase Value  Average Purchase Price
Age Range
<10                    23                 77.13                3.353478
10-14                  28                 82.78                2.956429
15-19                 136                412.89                3.035956
20-24                 365               1114.06                3.052219
25-29                 101                293.00                2.900990
30-34                  73                214.00                2.931507
35-39                  41                147.67                3.601707
40+                    13                 38.24                2.941538

In [147]:
# Check how many items each player (by Screen Name) purchased
player_purchases = purchase_data["SN"].value_counts()

In [148]:
# How many purchases did each player make
player_purchases.head(20)

Lisosia93       5
Idastidru52     4
Iral74          4
Saistyphos30    3
Hiaral50        3
Chanastnya43    3
Aina42          3
Saedaiphos46    3
Idai61          3
Siallylis44     3
Haillyrgue51    3
Aelin32         3
Umolrian85      3
Ialallo29       3
Tyisur83        3
Chamjask73      3
Inguron55       3
Asur53          3
Tyidaim51       3
Zontibe81       3
Name: SN, dtype: int64

In [149]:
# Use each SN in the player purchases and use it as index
index_unique_players = purchase_data.groupby("SN")
index_unique_players.count()

               Purchase ID  Age  Gender  Item ID  Item Name  Price  Age Range
SN
Adairialis76             1    1       1        1          1      1          1
Adastirin33              1    1       1        1          1      1          1
Aeda94                   1    1       1        1          1      1          1
Aela59                   1    1       1        1          1      1          1
Aelaria33                1    1       1        1          1      1          1
...                    ...  ...     ...      ...        ...    ...        ...
Yathecal82               3    3       3        3          3      3          3
Yathedeu43               2    2       2        2          2      2          2
Yoishirrala98            1    1       1        1          1      1          1
Zhisrisu83               2    2       2        2          2      2          2
Zontibe81                3    3       3        3          3      3          3

[576 rows x 7 columns]

In [150]:
# Add purchases for each individual player (by SN). Only column that "matters" is Price
each_sn_purchase = index_unique_players.sum()
each_sn_purchase

               Purchase ID  Age  Item ID  Price
SN
Adairialis76           467   16    123.0   2.28
Adastirin33            142   35    175.0   4.48
Aeda94                 388   17    128.0   4.91
Aela59                  28   21    119.0   4.32
Aelaria33              630   23    171.0   1.79
...                    ...  ...      ...    ...
Yathecal82            1400   60    241.0   6.22
Yathedeu43             688   44    143.0   6.02
Yoishirrala98          572   17    145.0   4.58
Zhisrisu83             195   20     85.0   7.89
Zontibe81             1019   63    247.0   8.03

[576 rows x 4 columns]

In [151]:
# Pulling only column that matters to find total amount spent per SN
total_sn_purchase = each_sn_purchase["Price"]
total_sn_purchase

SN
Adairialis76     2.28
Adastirin33      4.48
Aeda94           4.91
Aela59           4.32
Aelaria33        1.79
                 ...
Yathecal82       6.22
Yathedeu43       6.02
Yoishirrala98    4.58
Zhisrisu83       7.89
Zontibe81        8.03
Name: Price, Length: 576, dtype: float64

In [152]:
top_total_SN = total_sn_purchase.sort_values(ascending=False)

In [153]:
# Use the SN index and count how many purchases they made. Count = how many, instead of sum to add 
num_of_purchases = index_unique_players.count()
num_of_purchases

               Purchase ID  Age  Gender  Item ID  Item Name  Price  Age Range
SN
Adairialis76             1    1       1        1          1      1          1
Adastirin33              1    1       1        1          1      1          1
Aeda94                   1    1       1        1          1      1          1
Aela59                   1    1       1        1          1      1          1
Aelaria33                1    1       1        1          1      1          1
...                    ...  ...     ...      ...        ...    ...        ...
Yathecal82               3    3       3        3          3      3          3
Yathedeu43               2    2       2        2          2      2          2
Yoishirrala98            1    1       1        1          1      1          1
Zhisrisu83               2    2       2        2          2      2          2
Zontibe81                3    3       3        3          3      3          3

[576 rows x 7 columns]

In [154]:
# Take number of purchases and limit to the only column we need
individual_purchase_num = num_of_purchases['Purchase ID']
# Rename list
individual_purchase_num = individual_purchase_num.rename("Purchase Count")

individual_purchase_num

SN
Adairialis76     1
Adastirin33      1
Aeda94           1
Aela59           1
Aelaria33        1
                ..
Yathecal82       3
Yathedeu43       2
Yoishirrala98    1
Zhisrisu83       2
Zontibe81        3
Name: Purchase Count, Length: 576, dtype: int64

In [155]:
# Find average amount spent between total amount/number of purchases
avg_sn_purchase = total_sn_purchase/individual_purchase_num

In [156]:
# Create new df to show number of purchases, average per purchase and Total spent
top_spenders = pd.DataFrame({
    "Purchase Count": individual_purchase_num,
    "Average Purchase Price": avg_sn_purchase,
    "Total Purchases": total_sn_purchase
    })

# Format each column to display currency
top_spenders["Average Purchase Price"] = top_spenders["Average Purchase Price"].map("${:.2f}".format)
top_spenders["Total Purchases"] = top_spenders["Total Purchases"].map("${:.2f}".format)

top_spenders

               Purchase Count Average Purchase Price Total Purchases
SN
Adairialis76                1                  $2.28           $2.28
Adastirin33                 1                  $4.48           $4.48
Aeda94                      1                  $4.91           $4.91
Aela59                      1                  $4.32           $4.32
Aelaria33                   1                  $1.79           $1.79
...                       ...                    ...             ...
Yathecal82                  3                  $2.07           $6.22
Yathedeu43                  2                  $3.01           $6.02
Yoishirrala98               1                  $4.58           $4.58
Zhisrisu83                  2                  $3.94           $7.89
Zontibe81                   3                  $2.68           $8.03

[576 rows x 3 columns]

# **Top Spenders**

In [157]:
# Sort by descending order to show top 5 highest spenders
highest_spender = top_spenders.sort_values(by='Purchase Count', ascending=False)
highest_spender.head()

             Purchase Count Average Purchase Price Total Purchases
SN
Lisosia93                 5                  $3.79          $18.96
Iral74                    4                  $3.40          $13.62
Idastidru52               4                  $3.86          $15.45
Asur53                    3                  $2.48           $7.44
Inguron55                 3                  $3.70          $11.11

In [158]:
# Most Popular Items Start
# Pull original df
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Range
0,0,Lisim78,20,Male,108.0,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143.0,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92.0,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100.0,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131.0,Fury,1.44,20-24

In [159]:
# Create new df using only data we need. 
items_df = purchase_data[["Purchase ID", "Item ID", "Item Name", "Price"]]
items_df.head()

   Purchase ID  Item ID                                  Item Name  Price
0            0    108.0  Extraction, Quickblade Of Trembling Hands   3.53
1            1    143.0                          Frenzied Scimitar   1.56
2            2     92.0                               Final Critic   4.88
3            3    100.0                                Blindscythe   3.27
4            4    131.0                                       Fury   1.44

In [173]:
# Create df using Item ID as index
id_index = items_df.groupby("Item ID")
id_index.count().head()

         Purchase ID  Item Name  Price
Item ID
0.0                4          4      4
1.0                4          4      4
2.0                6          6      6
3.0                6          6      6
4.0                5          5      5

In [161]:
# Add price for each Item ID to obtain total profit per ID
total_per_id = id_index.sum()
total_per_id.head()

         Purchase ID  Price
Item ID
0.0             1149   5.12
1.0             1523  11.77
2.0             2006  14.88
3.0             2087  14.94
4.0             1885   8.50

In [162]:
# Pulling only column that matters to find total amount spent per ID
total_item_purchase = total_per_id["Price"]
total_item_purchase

Item ID
0.0       5.12
1.0      11.77
2.0      14.88
3.0      14.94
4.0       8.50
         ...
178.0    50.76
179.0    26.88
181.0     8.30
182.0    12.09
183.0     3.27
Name: Price, Length: 179, dtype: float64

In [163]:
# Create df of total amount spent per ID
total_item_purchase_df = pd.DataFrame(total_item_purchase)
total_item_purchase_df.head(10)

         Price
Item ID
0.0       5.12
1.0      11.77
2.0      14.88
3.0      14.94
4.0       8.50
5.0      16.32
6.0       7.40
7.0       9.31
8.0      11.79
9.0      10.92

In [164]:
# Total Purchase Value data frame
total_item_purchase_df = total_item_purchase_df.rename(columns={"Price": "Total Purchase Value"})
total_item_purchase_df.head()

         Total Purchase Value
Item ID
0.0                      5.12
1.0                     11.77
2.0                     14.88
3.0                     14.94
4.0                      8.50

In [165]:
# Find Purchase Count by counting how many times each ID repeats
id_count = id_index.count()
id_count

         Purchase ID  Item Name  Price
Item ID
0.0                4          4      4
1.0                4          4      4
2.0                6          6      6
3.0                6          6      6
4.0                5          5      5
...              ...        ...    ...
178.0             12         12     12
179.0              6          6      6
181.0              5          5      5
182.0              3          3      3
183.0              3          3      3

[179 rows x 3 columns]

In [166]:
# Purchase Count: Take number of purchases and limit to the only column we need
id_count_purchases = id_count['Purchase ID']

id_count_purchases.head()

Item ID
0.0    4
1.0    4
2.0    6
3.0    6
4.0    5
Name: Purchase ID, dtype: int64

In [167]:
# Purchase Count df
purchase_count_df = pd.DataFrame(id_count_purchases)
purchase_count_df.head()

         Purchase ID
Item ID
0.0                4
1.0                4
2.0                6
3.0                6
4.0                5

In [168]:
# Purchase Count Data Frame
purchase_count_df = purchase_count_df.rename(columns={"Purchase ID": "Purchase Count"})
purchase_count_df.head()

         Purchase Count
Item ID
0.0                   4
1.0                   4
2.0                   6
3.0                   6
4.0                   5

In [178]:
# Use item index to organize item names
#name_index = items_df.groupby("Item Name")
#name_index.count()
items_df.head()

   Purchase ID  Item ID                                  Item Name  Price
0            0    108.0  Extraction, Quickblade Of Trembling Hands   3.53
1            1    143.0                          Frenzied Scimitar   1.56
2            2     92.0                               Final Critic   4.88
3            3    100.0                                Blindscythe   3.27
4            4    131.0                                       Fury   1.44

In [187]:
# Sorted data frame by Item ID to place first ID to corresponding Item Name 
sort_by_ID = items_df.sort_values(by="Item ID",ascending=True)
sort_by_ID.head()

     Purchase ID  Item ID Item Name  Price
204          204      0.0  Splinter   1.28
133          133      0.0  Splinter   1.28
150          150      0.0  Splinter   1.28
662          662      0.0  Splinter   1.28
121          121      1.0  Crucifer   3.26

In [212]:
name_group = sort_by_ID.groupby("Item ID").agg({'Item Name':'first'}).reset_index()

In [206]:
item_name_only = name_group["Item Name"]
item_name_only.head()

0              Splinter
1              Crucifer
2               Verdict
3          Phantomlight
4    Bloodlord's Fetish
Name: Item Name, dtype: object

In [207]:
# Item Name Data Frame
item_name_only_df = pd.DataFrame(item_name_only)
item_name_only_df.head()

            Item Name
0            Splinter
1            Crucifer
2             Verdict
3        Phantomlight
4  Bloodlord's Fetish

In [213]:
# Item Price Df
price_group = sort_by_ID.groupby("Item ID").agg({'Price':'first'}).reset_index()
price_only = price_group["Price"]
price_only_df = pd.DataFrame(price_only)
price_only_df.head()

   Price
0   1.28
1   3.26
2   2.48
3   2.49
4   1.70

In [233]:
# Create new data frame of combined Most Profitable Items
most_popular = pd.DataFrame({
    "Item Name": item_name_only,
    "Purchase Count": id_count_purchases,
    "Item Price": price_only,
    "Total Purchase Value": total_item_purchase   
     
    })
most_popular.head()

              Item Name  Purchase Count  Item Price  Total Purchase Value
0.0            Splinter             4.0        1.28                  5.12
1.0            Crucifer             4.0        3.26                 11.77
2.0             Verdict             6.0        2.48                 14.88
3.0        Phantomlight             6.0        2.49                 14.94
4.0  Bloodlord's Fetish             5.0        1.70                  8.50

# Most Popular Items

In [234]:
top_most_popular = most_popular.sort_values(by="Total Purchase Value", ascending=False)
top_most_popular.head(5)

,Item Name,Purchase Count,Item Price,Total Purchase Value
92.0,Mourning Blade,13.0,3.49,59.99
178.0,Dragon's Greatsword,12.0,1.09,50.76
82.0,Arcane Gem,9.0,3.79,44.10
145.0,"Tranquility, Razor of Black Magic",9.0,1.75,41.22
103.0,Crying Steel Sickle,8.0,3.41,34.80